// Задача 29: Пользователь вводит 8 чисел. Поместите их в массив и распечатайте.

using System;

Console.WriteLine("Введите 1 элемент массива");
int num1 = int.Parse(Console.ReadLine()!);

Console.WriteLine("Введите 2 элемент массива");
int num2 = int.Parse(Console.ReadLine()!);

Console.WriteLine("Введите 3 элемент массива");
int num3 = int.Parse(Console.ReadLine()!);

Console.WriteLine("Введите 4 элемент массива");
int num4 = int.Parse(Console.ReadLine()!);

Console.WriteLine("Введите 5 элемент массива");
int num5 = int.Parse(Console.ReadLine()!);

Console.WriteLine("Введите 6 элемент массива");
int num6 = int.Parse(Console.ReadLine()!);

Console.WriteLine("Введите 7 элемент массива");
int num7 = int.Parse(Console.ReadLine()!);

Console.WriteLine("Введите 8 элемент массива");
int num8 = int.Parse(Console.ReadLine()!);

Console.WriteLine($"Получившийся массив - [{num1}, {num2}, {num3}, {num4}, {num5}, {num6}, {num7}, {num8}]");